
#include <iostream>
#include <fstream>
#include <conio.h>
#include <string>
#include "product.h"
#include "price.h"

int main()
{
	setlocale(LC_ALL, "UA");
	Price* price = new Price();

	while (true) {
		int choice;
		std::cout << "Choice an action:\n"
			<< "1: Init price\n"
			<< "2: Load price\n"
			<< "3: Show price\n"
			<< "4: Show from cheap to expensive\n"
			<< "0: Exit\n";

		choice = _getch();
		switch (choice) {
		case 49:  // '1'
			if (price->init()) {
				std::cout << "Price init success" << std::endl;
			}
			else {
				std::cout << "Price init error" << std::endl;
			}
			break;
		case 50:  // '2'
			if (price->load()) {
				std::cout << "Price load success" << std::endl;
			}
			else {
				std::cout << "Price load error" << std::endl;
			}
			break;
		case 51:  // '3'
			price->show();
			break;
		case 52:  // '4'
			price->show_by_price_ascending();
			break;
		case 48:  // '0'
			return 0;
		default:
			std::cout << "Invalid choice" << std::endl;
		}
	}
	return 0;
}
/*
 Git - VCS (Version Control System)
 Система, що дозволяє "зберігати" версії коду з можливістю повернення до попередніх версій,
 а також утворення відгалужень (гілок) з різним розвитком проєкту.

 Суть - збереження "різниці" - відмінностей між попереднім і поточним станом проєкту - коміти (commits).
 Це також спрощує сумісну роботу з проєктом різними учасниками.

 Github - hub (місце для розміщення) репозиторіїв.
 Репозиторій - частина проєкту, до якої входить код, напрацьований розробниками, і не входять загальні ресурси,
 які можна довантажити окремо (загальні бібліотеки, тощо), а також результати компіляції та збірки (проміжні та виконавчі файли).
 Відмінність задається спеціальним файлом ".gitignore".

 Для того, щоб створити і опублікувати репозиторій потрібно:
 - ініціалізувати репозиторій Git -> Crate Git Repository
 - створити перший коміт
 - опублікувати репозиторій (GitHub, Azure, DevOps, BitBucket, GitLab, тощо).
 = Visual Studio дозволяє поєднати всі ці кроки
	Git->Create Git Repository
	Але за наявного облікового запису.

 ____________________Система контролю версій. Продовження____________________
 [ПК]	-- git init -- [git]   -- git push -- [GitHub]
 Project (P58)													https://GitHub
	Source		|				Source		| git		
	Headers		| git add .		Headers		| commit	push
	Resources	|				Resources	| -m "message"
	References	x	
	x64			x

 Відмінність проекту та репозиторію - репозиторій є частиною проекту, до якої входить лише те,
 що неможна взяти з загальних джерел або створити компіляцією чи виконанням проекту.
 Ця відмінність задається у файлі ".gitignore".
 Репозиторій не заповнюється автоматично, слід зазначити які файли до нього долучити (подати команду git add).
 Commit - "збереження" поточного стану файлів репозиторію, яке дає можливість пізніше повернутися до цього стану.

 ____________________Зворотні дії - клонування/витягування____________________
 Якщо на ПК немає проекту, то здійснюємо клонування:
 - Запускаємо студію, авторизуємось через GitHub
 - Вибираємо "clone a repository"
 - Натискаємо "GitHub" і знаходимо репозиторій 
	або вставляємо посилання на репозиторій, скопійоване з браузеру 
 - Після завершення клонування переходимо до проектного вигляду 
	дбл - клік на файл з разширенням .slnx (.slx для старих VS)

 Якщо проект є, але в старій версії, то 
 - відкриваємо проект (старий) у VS
 - відкриваємо View -> Git changes
 - знаходимо кнопку Pull (стрілка вниз)
 - натискаємо

 ____________________ СКВ проводження. Конфлікти. ____________________
 Конфлікти виникають коли різні "гілки" (зміни з різних джерел) намагаються внести дані,
 що суперечать один одному. Наприклад, було внесено зміни в один і той самий файл.
 Злиття (Merge) - процес узгодження конфліктів, прийняття підсумкової версії.
 У VS для цього є інструмент "Merge Editor". Якщо гілки вносять зміни в різні файли,
 то злиття здійснюється без конфліктів, проте прямий PUSH не виконується,
 необхідно прийняти "PULL then PUSH".
 Практична порада: розподіляти сумісну роботу таким чином,
 щоб не було необхідності різним виконавцям змінювати однакові файли.

*/